InformationRegisters/CRM_Комментарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_Комментарии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_Комментарии/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Функция ДобавитьКомментарий(ТекстКомментария,IDK,ИдентификаторКомментарияРодителя=Неопределено) Экспорт

	ЗаписьКоментарий = РегистрыСведений.CRM_Комментарии.СоздатьМенеджерЗаписи();
	ЗаписьКоментарий.Дата = ТекущаяДата();
	ЗаписьКоментарий.IDK = IDK;
	ЗаписьКоментарий.Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	Если ЗначениеЗаполнено(ИдентификаторКомментарияРодителя) Тогда
		ЗаписьКоментарий.ИдентификаторРодителя = ИдентификаторКомментарияРодителя;
	КонецЕсли;
	
	ЗаписьКоментарий.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
	ЗаписьКоментарий.ТекстКомментария = СокрЛП(ТекстКомментария);
	Попытка ЗаписьКоментарий.Записать(); Исключение Сообщить(ОписаниеОшибки()); Возврат Ложь; КонецПопытки;
	
	Возврат Истина;

КонецФункции

#КонецЕсли
